УТ_для_edt.РасширениеСмарт/src/InformationRegisters/смартРекомендации/смартРекомендации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>смартРекомендации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>СотрудникДавшийРекомендацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ГруппаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/смартРекомендации/Forms/смарт_ФормаЗаписи/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда 
		Запись.Автор=Пользователи.ТекущийПользователь();
		Запись.Дата=ТекущаяДатаСеанса();
	КонецЕсли;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаУдалить.Видимость=РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	МассивУжеРекомендованныхГрупп=ПолучитьМассивУжеРекомендованныхГрупп(Запись.Партнер,Запись.СотрудникДавшийРекомендацию); 
	Если МассивУжеРекомендованныхГрупп.Количество() И ГруппаВходитВУжеРекомендованные(Запись.ГруппаНоменклатуры,МассивУжеРекомендованныхГрупп) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Группа номенклатуры '"+Запись.ГруппаНоменклатуры+"' уже была рекомендована!",,"Запись.ГруппаНоменклатуры",,Отказ);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыФункции

&НаСервереБезКонтекста
Функция ГруппаВходитВУжеРекомендованные(Группа,МассвивГрупп)
	Если ЗначениеЗаполнено(Группа.Родитель) Тогда 
		Если МассвивГрупп.Найти(Группа.Родитель)=Неопределено Тогда 
			ГруппаВходитВУжеРекомендованные(Группа.Родитель,МассвивГрупп);
		Иначе
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;
	Возврат Ложь;
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьМассивУжеРекомендованныхГрупп(Партнер,Сотрудник)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартРекомендации.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	                    |ИЗ
	                    |	РегистрСведений.смартРекомендации КАК смартРекомендации
	                    |ГДЕ
	                    |	смартРекомендации.Партнер = &Партнер
	                    |	И смартРекомендации.СотрудникДавшийРекомендацию = &Сотрудник");
	Запрос.УстановитьПараметр("Партнер",Партнер);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаНоменклатуры");
КонецФункции	

#КонецОбласти
